libopencm3/libopencm3/lib/stm32/common/timer_common_all.c
@param[in] timer_peripheral Unsigned int32. Timer register address base TIM1 or
TIM8
*/

void timer_disable_break_main_output(uint32_t timer_peripheral)
{
#if ADVANCED_TIMERS
	if (TIMER_IS_ADVANCED(timer_peripheral)) {
		TIM_BDTR(timer_peripheral) &= ~TIM_BDTR_MOE;
	}
#else
	(void)timer_peripheral;
#endif
}

/*---------------------------------------------------------------------------*/
/** @brief Enable Automatic Output in Break

Enables the automatic output feature of the Break function of an advanced
timer so that the output is re-enabled at the next update event following a
break event.

@note This setting is only valid for the advanced timers.

@param[in] timer_peripheral Unsigned int32. Timer register address base TIM1 or
TIM8
*/

void timer_enable_break_automatic_output(uint32_t timer_peripheral)
{
#if ADVANCED_TIMERS
	if (TIMER_IS_ADVANCED(timer_peripheral)) {
		TIM_BDTR(timer_peripheral) |= TIM_BDTR_AOE;
	}
#else
	(void)timer_peripheral;
#endif
}

/*---------------------------------------------------------------------------*/
/** @brief Disable Automatic Output in Break

Disables the automatic output feature of the Break function of an advanced
timer so that the output is re-enabled at the next update event following a
break event.

@note This setting is only valid for the advanced timers.

@param[in] timer_peripheral Unsigned int32. Timer register address base TIM1 or
TIM8
*/

void timer_disable_break_automatic_output(uint32_t timer_peripheral)
{
#if ADVANCED_TIMERS
	if (TIMER_IS_ADVANCED(timer_peripheral)) {
		TIM_BDTR(timer_peripheral) &= ~TIM_BDTR_AOE;
	}
#else
	(void)timer_peripheral;
#endif
}

/*---------------------------------------------------------------------------*/
/** @brief Activate Break when Input High

Sets the break function to activate when the break input becomes high.

@note This setting is only valid for the advanced timers.

@param[in] timer_peripheral Unsigned int32. Timer register address base TIM1 or
TIM8
*/

void timer_set_break_polarity_high(uint32_t timer_peripheral)
{
#if ADVANCED_TIMERS
	if (TIMER_IS_ADVANCED(timer_peripheral)) {
		TIM_BDTR(timer_peripheral) |= TIM_BDTR_BKP;
	}
#else
	(void)timer_peripheral;
#endif
}

/*---------------------------------------------------------------------------*/
/** @brief Activate Break when Input Low

Sets the break function to activate when the break input becomes low.

@note This setting is only valid for the advanced timers.

@param[in] timer_peripheral Unsigned int32. Timer register address base TIM1 or
TIM8
*/

void timer_set_break_polarity_low(uint32_t timer_peripheral)
{
#if ADVANCED_TIMERS
	if (TIMER_IS_ADVANCED(timer_peripheral)) {
		TIM_BDTR(timer_peripheral) &= ~TIM_BDTR_BKP;
	}
#else
	(void)timer_peripheral;
#endif
}

/*---------------------------------------------------------------------------*/
/** @brief Enable Break

Enables the break function of an advanced timer.

@note This setting is only valid for the advanced timers.

@param[in] timer_peripheral Unsigned int32. Timer register address base TIM1 or
TIM8
*/

void timer_enable_break(uint32_t timer_peripheral)
{
#if ADVANCED_TIMERS
	if (TIMER_IS_ADVANCED(timer_peripheral)) {
		TIM_BDTR(timer_peripheral) |= TIM_BDTR_BKE;
	}
#else
	(void)timer_peripheral;
#endif
}

/*---------------------------------------------------------------------------*/
/** @brief Disable Break

Disables the break function of an advanced timer.

@note This setting is only valid for the advanced timers.

@param[in] timer_peripheral Unsigned int32. Timer register address base TIM1 or
TIM8
*/

void timer_disable_break(uint32_t timer_peripheral)
{
#if ADVANCED_TIMERS
	if (TIMER_IS_ADVANCED(timer_peripheral)) {
		TIM_BDTR(timer_peripheral) &= ~TIM_BDTR_BKE;
	}
#else
	(void)timer_peripheral;
#endif
}

/*---------------------------------------------------------------------------*/
/** @brief Enable Off-State in Run Mode

Enables the off-state in run mode for the break function of an advanced
timer in which the complementary outputs have been configured. It has no effect
if no complementary output is present. When the capture-compare output is
disabled while the complementary output is enabled, the output is set to its
inactive level as defined by the output polarity.

@note This setting is only valid for the advanced timers.

@param[in] timer_peripheral Unsigned int32. Timer register address base TIM1 or
TIM8
*/

void timer_set_enabled_off_state_in_run_mode(uint32_t timer_peripheral)
{
#if ADVANCED_TIMERS
	if (TIMER_IS_ADVANCED(timer_peripheral)) {
		TIM_BDTR(timer_peripheral) |= TIM_BDTR_OSSR;
	}
#else
	(void)timer_peripheral;
#endif
}

/*---------------------------------------------------------------------------*/
/** @brief Disable Off-State in Run Mode

Disables the off-state in run mode for the break function of an advanced
timer in which the complementary outputs have been configured. It has no effect
if no complementary output is present. When the capture-compare output is
disabled, the output is also disabled.

@note This setting is only valid for the advanced timers.

@param[in] timer_peripheral Unsigned int32. Timer register address base TIM1 or
TIM8
*/

void timer_set_disabled_off_state_in_run_mode(uint32_t timer_peripheral)
{
#if ADVANCED_TIMERS
	if (TIMER_IS_ADVANCED(timer_peripheral)) {
		TIM_BDTR(timer_peripheral) &= ~TIM_BDTR_OSSR;
	}
#else
	(void)timer_peripheral;
#endif
}

/*---------------------------------------------------------------------------*/
/** @brief Enable Off-State in Idle Mode

Enables the off-state in idle mode for the break function of an advanced
timer. When the master output is disabled the output is set to its
inactive level as defined by the output polarity.

@note This setting is only valid for the advanced timers.

@param[in] timer_peripheral Unsigned int32. Timer register address base TIM1 or
TIM8
*/

void timer_set_enabled_off_state_in_idle_mode(uint32_t timer_peripheral)
{
#if ADVANCED_TIMERS
	if (TIMER_IS_ADVANCED(timer_peripheral)) {
		TIM_BDTR(timer_peripheral) |= TIM_BDTR_OSSI;
	}
#else
	(void)timer_peripheral;
#endif
}

